app/Controllers/FormKtam.php

INSERT INTO `ktam` (`nik`, `nama_lengkap`, `gelar_depan`, `gelar_belakang`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `status_perkawinan`, `alamat`, `provinsi`, `kota`, `kecamatan`, `kelurahan`, `kode_pos`, `daerah`, `cabang`, `email`, `nomor_hp`, `profesi`, `profesi_lainnya`, `pekerjaan`, `tempat_kerja`, `pendidikan_terakhir`, `riwayat_sd`, `riwayat_smp`, `riwayat_sma`, `riwayat_diploma`, `riwayat_s1`, `riwayat_s2`, `riwayat_s3`, `pernah_belajar_ponpes`, `bahasa_indonesia`, `bahasa_arab`, `bahasa_inggris`, `bahasa_lainnya`, `organisasi_lain`) VALUES ('1000239', 'Rio Naditra', 'DR', 'M.PD', 'Semarang', '10/06/1999', 'Laki-Laki', 'Belum Menikah', 'jl.cijahe rt 02 rw 01 no 01', '13', '1302', '1302020', '1302020006', '16113', 'Sumatera Barat', '8', 'naditrario@gmail.com', '089513716046', 'Wiraswasta', 'prof lainnya', 'Belum Bekerja', 'PT. DARO DATA', 'SMA', 'SD 1', 'SMP 1', 'SMA 1', 'D1', 'SAINTEK M', 'S2', 'S3', 'Tidak Pernah', 'Aktif', 'Aktif', 'Pasif', 'Pasif', 'ORG LAIN')
---
        // print_r($dataFormKtam);
        // echo "</pre>";

        $ktamModel->insert($dataFormKtam);

INSERT INTO `organisasi_anggota` (`cabang`, `daerah`, `nik`, `org_id`, `pusat`, `ranting`, `wilayah`)
VALUES ('1','1','1000239','1','1','1','1'), ('1','1','1000239','2','1','1','1'), (0,0,'1000239','3','1','1',0), (0,0,'1000239','4','1','1',0), (0,0,'1000239','5','1',0,'1'), (0,0,'1000239','6','1','1',0), (0,0,'1000239','7','1','1',0), (0,0,'1000239','8','1','1',0)
---
            // Simpan data pengalaman organisasi ke tabel `anggota_pengalaman`

            if (!empty($dataOrganisasiAnggota)) {
                if($organisasiAnggotaModel->insertBatch($dataOrganisasiAnggota)){