app/Controllers/Ktam.php

SELECT *
FROM `ktam`
---
    public function getData()
    {
        $model = new KtamModel();
        $data = $model->findAll();